Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In certain situations, it is practical to obtain a bean instance programmatically via an injected `javax.enterprise.inject.Instance` and `Instance.get()`. However, according to the specification the `get()` method must identify the matching bean and obtain a contextual reference. As a consequence, a new instance of a `@Dependent` bean is returned from each invocation of `get()`. Moreover, this instance is a dependent object of the injected `Instance`. This behavior is well-defined but it may lead to unexpected errors and memory leaks. Therefore, Quarkus comes with the `io.quarkus.arc.WithCaching` annotation. An injected `Instance` annotated with this annotation will cache the result of the `Instance#get()` operation. The result is computed on the first call and the same value is returned for all subsequent calls, even for `@Dependent` beans.
ja_jp: 特定の状況では、注入された `javax.enterprise.inject.Instance` および `Instance.get()` を介してプログラムで Bean インスタンスを取得することが実用的です。ただし、仕様によれば、 `get ()` メソッドは一致する Bean を識別し、コンテキスト参照を取得する必要があります。結果として、 `@Dependent` Bean の新しいインスタンスが、 `get()` の各呼び出しから返されます。さらに、このインスタンスは、注入された `Instance` の依存オブジェクトです。この動作は明確に定義されていますが、予期しないエラーやメモリーリークが発生する可能性があります。したがって、Quarkus には `io.quarkus.arc.WithCaching` アノテーションが付いています。このアノテーションを付けて注入された `Instance` は、 `Instance#get()` 操作の結果をキャッシュします。結果は最初の呼び出しで計算され、 `@Dependent` Bean の場合でも、後続のすべての呼び出しで同じ値が返されます。

source: In certain situations, it is practical to obtain a bean instance programmatically via an injected `javax.enterprise.inject.Instance` and `Instance.get()`. However, according to the specification the `get()` method must identify the matching bean and obtain a contextual reference. As a consequence, a new instance of a `@Dependent` bean is returned from each invocation of `get()`. Moreover, this instance is a dependent object of the injected `Instance`. This behavior is well-defined, but it may lead to unexpected errors and memory leaks. Therefore, Quarkus comes with the `io.quarkus.arc.WithCaching` annotation. An injected `Instance` annotated with this annotation will cache the result of the `Instance#get()` operation. The result is computed on the first call and the same value is returned for all subsequent calls, even for `@Dependent` beans.
ja_jp: 特定の状況では、注入された `javax.enterprise.inject.Instance` および `Instance.get()` を介してプログラムで Bean インスタンスを取得することが実用的です。ただし、仕様によれば、 `get()` メソッドは一致する Bean を識別し、コンテキスト参照を取得する必要があります。結果として、 `@Dependent` Bean の新しいインスタンスが、 `get()` の各呼び出しから返されます。さらに、このインスタンスは、注入された `Instance` の依存オブジェクトです。この動作は明確に定義されていますが、予期しないエラーやメモリーリークが発生する可能性があります。したがって、Quarkus には `io.quarkus.arc.WithCaching` アノテーションが付いています。このアノテーションを付けて注入された `Instance` は、 `Instance#get()` 操作の結果をキャッシュします。結果は最初の呼び出しで計算され、 `@Dependent` Bean の場合でも、後続のすべての呼び出しで同じ値が返されます。

source: In cloud environments where persistent storage is not available, such as when application containers are unable to use persistent volumes, you can configure the transaction management to store transaction logs in a database by using a Java Database Connectivity (JDBC) datasource.
ja_jp: アプリケーションコンテナが永続ボリュームを使用できない場合など、永続ストレージを使用できないクラウド環境では、Java Database Connectivity（JDBC）データソースを使用してトランザクションログをデータベースに格納するようにトランザクション管理を構成できます。

source: In code executed with `vertx.executeBlocking()`.
ja_jp: `vertx.executeBlocking()` で実行されるコードで:

source: In code submitted to `org.eclipse.microprofile.context.ManagedExecutor`.
ja_jp: `org.eclipse.microprofile.context.ManagedExecutor` に送信されたコードで:

source: In code, you typically need the following two steps.
ja_jp: コードでは、通常、以下の 2 つのステップが必要です。

source: In completing this step, you have just configured Quarkus to use the domain, client ID, and secret of your Auth0 application. Setting the property `quarkus.oidc.application-type=web-app` instructs Quarkus to use the OIDC authorization code flow, but there are also other methods, which are discussed later on in the tutorial.
ja_jp: この手順を完了すると、Auth0 アプリケーションのドメイン、クライアント ID、シークレットを使用するように Quarkus が設定されます。 `quarkus.oidc.application-type=web-app` プロパティーを設定することで、OIDC 認証コードフローを使用するように Quarkus に指示が出されますが、他の方法を使用することもできます。これについてはチュートリアルの後半で説明します。

source: In conclusion, I think the strong selling points for Quarkus are:
ja_jp: 結論として、Quarkusの強力なセールスポイントは以下の通りだと思います。

source: In contrast to JAX-RS (and RESTeasy) running in a standard servlet-container, Quarkus only supports the deployment of a single JAX-RS application. If multiple JAX-RS `Application` classes are defined, the build will fail with the message `Multiple classes have been annotated with @ApplicationPath which is currently not supported`.
ja_jp: JAX-RS(およびRESTeasy)が標準のサーブレットコンテナーで実行されているのとは対照的に、Quarkusは単一のJAX-RSアプリケーションのデプロイのみをサポートしています。複数のJAX-RS `Application` クラスが定義されている場合、ビルドは `Multiple classes have been annotated with @ApplicationPath which is currently not supported` というメッセージとともに失敗するでしょう。

source: In contrast to Jakarta REST (and RESTEasy) running in a standard servlet container, Quarkus only supports the deployment of a single Jakarta REST application. If multiple Jakarta REST `Application` classes are defined, the build will fail with the message `Multiple classes have been annotated with @ApplicationPath which is currently not supported`.
ja_jp: 標準的なサーブレットコンテナで動作する Jakarta REST (および RESTEasy) とは対照的に、Quarkus は単一の Jakarta REST アプリケーションのデプロイメントのみをサポートしています。 複数の Jakarta REST `Application` クラスが定義されている場合、ビルドは失敗し、`Multiple classes have been annotated with @ApplicationPath which is currently not supported` というメッセージが表示されます。

source: In contrast to Jakarta REST (and RESTeasy) running in a standard servlet-container, Quarkus only supports the deployment of a single Jakarta REST application. If multiple Jakarta REST `Application` classes are defined, the build will fail with the message `Multiple classes have been annotated with @ApplicationPath which is currently not supported`.
ja_jp: 標準的なサーブレットコンテナで動作するJakarta REST（およびRESTeasy）とは対照的に、Quarkusは単一のJakarta RESTアプリケーションのデプロイメントのみをサポートしています。複数のJakarta REST `Application` クラスが定義されている場合、ビルドは `Multiple classes have been annotated with @ApplicationPath which is currently not supported` というメッセージで失敗します。

source: In contrast with the preceding command, this command returns a `403` status code.
ja_jp: 前のコマンドとは対照的に、このコマンドは `403` ステータスコードを返します。

source: In contrast, `PUT /public/foo` does not match the method permissions of `permit1`. As a result, `deny1` is activated, leading to the rejection of the request.
ja_jp: 一方、 `PUT/public/foo` は `permit1` のメソッド権限とマッチしません。その結果、 `deny1` がアクティブになり、リクエストが拒否されます。

source: In contrast, in a production application the main objective for Quarkus is to consume the least amount of memory and startup in the smallest amount of time. Thus, when running the production application, build time operations are not performed (by definition) and various infrastructure classes needed at build time are not present at all at runtime. Furthermore, the purpose built ClassLoader that comes with the xref:maven-tooling.adoc#fast-jar[fast-jar] package type ensures that class lookup is done as fast as possible while also keeping the minimum amount of jars in memory.
ja_jp: 対照的に、プロダクションアプリケーションでは、Quarkusの主な目的は、最小のメモリを消費し、最小の時間で起動することです。したがって、本番アプリケーションを実行する際には、ビルド時の操作は（定義上）実行されず、ビルド時に必要なさまざまなインフラストラクチャクラスは、実行時にはまったく存在しません。さらに、 link:maven-tooling.html#fast-jar[fast-jar]パッケージタイプに付属する目的に応じて構築されたClassLoaderにより、クラスの検索が可能な限り高速に行われると同時に、メモリ内のjarの量も最小限に抑えられます。

source: In cryptography, a salt is a name for random data used as an additional input to a one-way function that hashes data, a password, or a passphrase.
ja_jp: 暗号技術において、ソルトとは、データ、パスワード、パスフレーズをハッシュ化する一方向性関数への追加入力として使用されるランダムデータの名称です。

source: In dev and test mode, Quarkus will start a mock AWS Lambda event server that will convert HTTP requests to the corresponding API Gateway event types and post them to the underlying Quarkus HTTP lambda environment for processing. This simulates the AWS Lambda environment as much as possible locally without requiring tools like Docker and SAM CLI.
ja_jp: 開発モードおよびテストモードでは、Quarkus は模擬 AWS Lambda イベントサーバーを起動し、対応する API Gateway イベントタイプに HTTP リクエストを変換し、処理のために基盤となる Quarkus HTTP Lambda 環境に送信します。これにより、Docker や SAM CLI などのツールを必要とせずに、AWS Lambda 環境を可能な限りローカルでシミュレートします。

source: In dev mode Quarkus will automatically restart the application if any of the existing migration scripts get modified. If you want to take advantage of this while developing and testing new migration scripts, you will want to set `%dev.quarkus.flyway.clean-at-start=true`, so that Flyway actually runs the modified migration.
ja_jp: 開発モードでは、既存のマイグレーションスクリプトが変更された場合、Quarkusは自動的にアプリケーションを再起動します。新しいマイグレーションスクリプトの開発やテスト中にこの機能を利用したい場合は、 `%dev.quarkus.flyway.clean-at-start=true` を設定し、変更したマイグレーションをFlywayが実際に実行するようにする必要があります。

source: In dev mode and when running tests, xref:amqp-dev-services.adoc[Dev Services for AMQP] automatically starts an AMQP broker.
ja_jp: 開発モードでテストを実行すると、xref:amqp-dev-services.adoc[Dev Services for AMQP] が自動的に AMQP ブローカーを開始します。

source: In dev mode and when running tests, xref:kubernetes-dev-services.adoc[Dev Services for Kubernetes] automatically starts a Kubernetes API server.
ja_jp: devモードやテスト実行時には、 link:kubernetes-dev-services.html[Dev Services for Kubernetes] が自動的にKubernetes APIサーバーを起動します。

source: In dev mode and when running tests, xref:rabbitmq-dev-services.adoc[Dev Services for RabbitMQ] automatically starts a RabbitMQ broker.
ja_jp: 開発モードでテストを実行すると、xref:rabbitmq-dev-services.adoc[Dev Services for RabbitMQ] が自動的に RabbitMQ ブローカーを起動します。

source: In dev mode, Quarkus uses a ClassLoader hierarchy (explained in detail in the xref:class-loading-reference.adoc[class loading reference]) that enables the live reload of user code without requiring a rebuild and restart of the application.
ja_jp: 開発モードでは、Quarkus は ClassLoader 階層 (詳細は xref:class-loading-reference.adoc[クラスローディングリファレンス] で説明されています) を使用します。これにより、アプリケーションの再ビルドや再起動を必要とせずに、ユーザーコードのライブリロードが可能になります。

source: In dev mode, Quarkus uses a ClassLoader hierarchy (explained in detail xref:class-loading-reference.adoc[here]) that enables the live reload of user code without requiring a rebuild and restart of the application.
ja_jp: 開発モードでは、Quarkus は ClassLoader 階層 (詳細は link:class-loading-reference.html[こちら]) を使用し、アプリケーションの再ビルドや再起動を必要とせずにユーザーコードのライブリロードを可能にしています。

source: In dev mode, `quarkus.grpc.server.instances` has no effect.
ja_jp: 開発モードでは、 `quarkus.grpc.server.instances` は効果がありません。

source: In dev mode, it is also possible to enable monitoring of business method invocations and fired events. Simply set the `quarkus.arc.dev-mode.monitoring-enabled` configuration property to `true` and explore the relevant Dev UI pages.
ja_jp: 開発モードでは、ビジネスメソッドの呼び出しと発生したイベントの監視を有効にすることもできます。 `quarkus.arc.dev-mode.monitoring-enabled` 設定プロパティーを `true` に設定し、関連する Dev UI ページを確認するだけです。

source: In dev mode, minimizing the runtime footprint of the application is not the primary objective (although Quarkus still starts plenty fast and consumes little memory) - the primary objective is enabling developer joy. Therefore, many more classes are loaded and build time operations also take place every time a live-reload is performed.
ja_jp: 開発モードでは、アプリケーションの実行時フットプリントを最小化することは主な目的ではありません (ただし、Quarkus は高速に起動し、メモリをほとんど消費しません)。主な目的は、開発者満足を実現することです。そのため、ライブリロードが実行されるたびに、より多くのクラスがロードされ、ビルド時の操作も行われます。

source: In dev mode, to reload the content of the `.redis` load scripts, you need to add: `%dev.quarkus.vertx.caching=false`
ja_jp: devモードでは、 `.redis` ロードスクリプトの内容を再読み込みするため、 `%dev.quarkus.vertx.caching=false` を追加する必要があります

source: In dev mode, two special endpoints are registered automatically to provide some basic debug info in the JSON format:
ja_jp: 開発モードでは、JSON 形式で基本的なデバッグ情報を提供するために、2 つの特別なエンドポイントが自動的に登録されます。

source: In dev mode, with live reload, Quarkus may restart frequently. By default, this will also restart test containers. Quarkus restarts are usually very fast, but containers may take much longer to restart. To prevent containers restarting on every code change, you can mark the container as reusable:
ja_jp: 開発モードでは、ライブリロードにより、Quarkus が頻繁に再起動する場合があります。デフォルトでは、これによりテストコンテナーも再起動されます。 Quarkus の再起動は通常非常に高速ですが、コンテナーの再起動にはさらに長い時間がかかる場合があります。 コードを変更するたびにコンテナーが再起動するのを防ぐには、コンテナーを再利用可能としてマークします。

source: In dev mode, you can use the xref:infinispan-dev-services.adoc[Infinispan Dev Service].
ja_jp: 開発モードでは、xref:infinispan-dev-services.adoc[Infinispan Dev Service] を使用できます。

source: In dev mode, you can use the xref:redis-dev-services.adoc[Redis Dev Service].
ja_jp: 開発モードでは、 xref:redis-dev-services.adoc[Redis Dev Service] を使用することができます。

source: In dev-mode minimizing the runtime footprint of the application is not the primary objective (although Quarkus still starts plenty fast and consumes little memory even in dev-mode) - the primary objective is enabling developer joy. Therefore, many more classes are loaded and build time operations also take place every time a live-reload is performed.
ja_jp: 開発モードでは、アプリケーションの実行時フットプリントを最小化することは主な目的ではありません（ただし、Quarkusは開発モードでも高速に起動し、メモリをほとんど消費しません） - 主な目的は、開発者満足を実現することです。そのため、ライブリロードが実行されるたびに、より多くのクラスがロードされ、ビルド時の操作も行われます。

source: In dev-mode, Quarkus uses a ClassLoader hierarchy (explained in detail xref:class-loading-reference.adoc[here]) that enables the live reload of user code without requiring a rebuild and restart of the application.
ja_jp: 開発モードでは、QuarkusはClassLoader階層（詳細は link:class-loading-reference.html[こちら]）を使用し、アプリケーションの再ビルドや再起動を必要とせずにユーザーコードのライブリロードを可能にしています。

source: In dev-mode, `quarkus.grpc.server.instances` has no effect.
ja_jp: dev-modeでは、 `quarkus.grpc.server.instances` は効果がありません。

source: In development and other non-production modes, the resources are kept in memory and loaded using the `QuarkusClassLoader`.
ja_jp: 開発モードやその他の本番以外のモードでは、リソースはメモリー内に保持され、 `QuarkusClassLoader` を使用してロードされます。

source: In development mode, Quarkus serves these resources using a Vertx handler backed by a classloader-based filesystem.
ja_jp: 開発モードでは、Quarkus はこれらのリソースを、クラスローダーベースのファイルシステムを利用した Vertx ハンドラーを通じて提供します。

source: In development mode, Quarkus starts by default with debug mode enabled, listening to port `5005` without suspending the JVM.
ja_jp: 開発モードでは、Quarkusはデフォルトでデバッグモードを有効にして起動し、JVMをサスペンドせずにポート `5005` をリッスンします。

source: In development mode, the database is set up with a few rows in the `fruits` table. To retrieve all the data, we will use the `query` method again:
ja_jp: 開発モードでは、データベースは `fruits` テーブルのいくつかの行で設定されます。すべてのデータを取得するには、 `query` メソッドを再度使用します。

source: In development mode, these resources are served dynamically using Vertx.
ja_jp: 開発モードでは、これらのリソースは Vertx を使用して動的に提供されます。

source: In documents like tutorials, you may want to reference source code that is built and tested regularly. The Quarkus documentation build copies source files enumerated in `*-examples/yaml` files into a flattened structure in the `target/asciidoc/examples` directory (from the project root).
ja_jp: チュートリアルなどのドキュメントでは、定期的にビルドおよびテストされたソースコードを参照する必要がある場合があります。 Quarkus ドキュメントビルドは、 `*-examples/yaml` ファイルに列挙されたソースファイルを、 `target/asciidoc/examples` ディレクトリー (プロジェクトルートから) 内のフラット化された構造にコピーします。

source: In documents like tutorials, you may want to reference source code that is built and tested regularly. The Quarkus documentation module build will copy source files enumerated in `*-examples/yaml` files into a flattened structure in the `target/asciidoc/examples` directory (from the project root).
ja_jp: チュートリアルなどのドキュメントでは、定期的にビルドおよびテストされているソースコードを参照したい場合があります。Quarkus ドキュメントモジュールのビルドは、 `*-examples/yaml` ファイルに列挙されたソースファイルを (プロジェクトルートから) `target/asciidoc/examples` ディレクトリーのフラット化された構造にコピーします。

source: In each of your resource class, declare a `@CheckedTemplate static class Template {}` class within your resource class.
ja_jp: 各リソースクラスで、リソースクラス内で `@CheckedTemplate static class Template {}` クラスを宣言します。

source: In earlier versions of the extension, the `quarkus.` was missing from those properties. These properties are now deprecated.
ja_jp: 以前のバージョンのエクステンションでは、これらのプロパティーに `quarkus.` がありませんでした。これらのプロパティーは現在非推奨となっています。

source: In environments with read only file systems you may receive errors of the form:
ja_jp: ファイルシステムが読み取り専用の環境では、次のようなエラーが発生することがあります。

source: In essence a rule unit is made of 2 strictly related parts: the definition of the fact to be evaluated and the set of rules evaluating them. The first part is implemented with a POJO, that for the loan example could be something like the following:
ja_jp: 本質的に、ルールユニットは、評価されるファクトの定義と、それらを評価するルールのセットという、厳密に関連した 2 つの部分で構成されます。最初の部分は POJO で実装され、ローンの例では次のようになります。

source: In essence, we need to create a ConfigMap in the namespace `openshift-monitoring`.
ja_jp: 突きつめると、名前空間 `openshift-monitoring` に ConfigMap を作成する必要があります。

source: In extension modules, `Log` works only if the module includes a Jandex index. However, this behavior is unsupported and can lead to unreliable logging.
ja_jp: 拡張モジュールでは、モジュールに Jandex インデックスが含まれている場合にのみ `Log` が機能します。 ただし、この動作はサポートされておらず、ロギングの信頼性が低くなる可能性があります。

source: In fact, the interesting part is that we will need to add very few elements to make our full text search application working.
ja_jp: 実は、全文検索アプリケーションを動作させるために必要な要素はごくわずかです。

source: In fact, the last code example, showing the injected `UserInfo`, is a concrete example of the access token propagation, in this case, Quarkus propagates the Auth0 access token to the Auth0 `UserInfo` endpoint to acquire `UserInfo`. Quarkus does it without users having to do anything themselves.
ja_jp: 実際、注入された `UserInfo` を示す最後のサンプルコードは、具体的なアクセストークンを伝播した例です。この場合、Quarkus は Auth0 アクセストークンを Auth0 `UserInfo` エンドポイントに伝播して `UserInfo` を取得します。Quarkus は、ユーザーが何もしなくてもこれを実行します。

source: In fact, the operators are implemented as "virtual methods" that consume one parameter and can be used with infix notation. For example `{person.name or 'John'}` is translated to `{person.name.or('John')}` and `{item.isActive ? item.name : 'Inactive item'}` is translated to `{item.isActive.ifTruthy(item.name).or('Inactive item')}`
ja_jp: 実際、オペレーターは 1 つのパラメーターを消費する "仮想メソッド" として実装されており、infix 記法で使用することができます。例えば、`{person.name or 'John'}` は `{person.name.or('John')}` に、`{item.isActive ? item.name : 'Inactive item'}` は `{item.isActive.ifTruthy(item.name).or('Inactive item')}` に変換されます。

source: In general it is not possible to use the Hibernate ORM database generation feature in conjunction with a multitenancy setup. Therefore you have to disable it and you need to make sure that the tables are created per schema. The following setup will use the xref:flyway.adoc[Flyway] extension to achieve this goal.
ja_jp: 一般的に、Hibernate ORMデータベース生成機能をマルチテナンシーセットアップと組み合わせて使用することはできません。 そのため、この機能を無効にし、スキーマごとにテーブルが作成されるようにする必要があります。 以下のセットアップでは、この目標を達成するために xref:flyway.adoc[Flyway] エクステンションを使用します。

source: In general, Java web applications use imperative programming combined with blocking IO operations. This is incredibly popular because it is easier to reason about the code. Things get executed sequentially. When the application receives a request, the framework associates this request to a worker thread. When the request processing needs to interact with a database or another remote service, it relies on blocking IO. The thread is blocked waiting for the answer, making the communication synchronous. With this model one request is not affected by another as they are run on different threads. Even when one thread is waiting, other requests running on different threads are not slowed down significantly.
ja_jp: 一般的に、Java のWeb アプリケーションでは、ブロッキング IO 操作と組み合わせた命令型プログラミングを使用します。これは、コードを推論するのが簡単なので、非常に人気があります。物事は順次実行されます。アプリケーションがリクエストを受け取ると、フレームワークはこのリクエストをワーカースレッドに関連付けます。リクエスト処理がデータベースや他のリモートサービスと対話する必要があるときは、ブロッキング IO に依存します。スレッドは応答を待ってブロックされ、通信を同期化します。このモデルでは、1 つのリクエストは別のスレッドで実行されるので、別のリクエストの影響を受けません。1 つのスレッドが待機している場合でも、異なるスレッド上で実行されている他のリクエストが大幅に遅くなることはありません。

source: In general, Quarkus invokes reactive code on duplicated contexts. So it can safely access the local data. It is the case with:
ja_jp: 一般的に、Quarkusは複製コンテキストに対してリアクティブコードを呼び出します。 そのため、ローカルデータに安全にアクセスできます。 これは以下に適用されます:

source: In general, Vert.x verticles are not CDI beans. And so cannot use injection. However, in Quarkus, you can deploy verticles as beans. Note that in this case, CDI (Arc in Quarkus) is responsible for creating the instance.
ja_jp: 一般的に、Vert.xのバーティクルはCDI Beanではありません。そのため、依存性注入は使用できません。しかし、QuarkusではVerticleをBeanとしてデプロイすることができます。この場合、CDI（QuarkusではArc）がインスタンスの作成を担当することに注意してください。

source: In general, for every runtime extension artifact dependency on another runtime extension artifact there must be a corresponding deployment extension artifact dependency on the other deployment extension artifact. And if the runtime dependency is declared as optional then the corresponding deployment dependency **must** also be configured as optional.
ja_jp: 一般に、ランタイムエクステンションアーティファクトが他のランタイムエクステンションアーティファクトに依存している場合、それに対応するデプロイメントエクステンションアーティファクトの依存関係がなければなりません。また、ランタイムの依存関係がオプションとして宣言されている場合は、対応するデプロイメントの依存関係もオプションとして設定する *必要があります* 。

source: In general, for every runtime extension artifact dependency on another runtime extension artifact there must be the corresponding deployment extension artifact dependency on the other deployment extension artifact. And if the runtime dependency is declared as optional then the corresponding deployment dependency **must** also be configured as optional.
ja_jp: 一般に、ランタイムエクステンションアーティファクトが他のランタイムエクステンションアーティファクトに依存している場合、それに対応するデプロイメントエクステンションアーティファクトの依存関係がなければなりません。また、ランタイムの依存関係がオプションとして宣言されている場合は、対応するデプロイメントの依存関係もオプションとして設定する *必要があります* 。

source: In general, gRPC uses HTTP/2, TLS, and https://developers.google.com/protocol-buffers[Protobuf (Protocol Buffers)]. In a microservice architecture, gRPC is an efficient, type-safe alternative to HTTP.
ja_jp: 一般的に、gRPCはHTTP/2、TLS、 link:https://developers.google.com/protocol-buffers[Protobuf(プロトコルバッファ)] を使用します。マイクロサービスアーキテクチャでは、gRPCはHTTPに代わる効率的で型安全な代替手段です。

source: In general, it is not possible to use the Hibernate ORM database generation feature in conjunction with a multitenancy setup. Therefore, you have to disable it, and you need to make sure that the tables are created per schema. The following setup will use the xref:flyway.adoc[Flyway] extension to achieve this goal.
ja_jp: 一般的に、Hibernate ORMのデータベース生成機能をマルチテナンシーのセットアップと組み合わせて使用することはできません。そのため、この機能を無効にして、テーブルがスキーマごとに作成されるようにする必要があります。以下のセットアップでは、 xref:flyway.adoc[Flyway] エクステンションを使用してこの目的を達成します。

source: In general, it should not be needed to have two different versions of the custom extension to support both flavors. Such a choice is only strictly necessary if it is desired for the extension consumers (i.e. Quarkus applications) to not have to select a RESTEasy version themselves.
ja_jp: 一般に、両方のフレーバーをサポートするために、カスタムエクステンションの2つの異なるバージョンを用意する必要はないはずです。このような選択が厳密に必要なのは、エクステンションの消費者（Quarkusアプリケーションなど）がRESTEasyのバージョンを自分で選択する必要がない場合のみです。

source: In general, path configurations for web content are interpreted relative to `quarkus.http.root-path` (which is / by default).
ja_jp: 一般に、ウェブコンテンツのパス設定は、 `quarkus.http.root-path` ( デフォルトでは / ) からの相対パスとして解釈されます。

source: In general, prefer link:https://docs.asciidoctor.org/asciidoc/latest/macros/url-macro/[url macros] to bare or automatic links. Provide human-readable text for the link, especially if it is included in the middle of other text.
ja_jp: 一般的に、素のリンクや自動リンクよりも link:https://docs.asciidoctor.org/asciidoc/latest/macros/url-macro/[urlマクロ] の方が望ましいです。特に、リンクが他のテキストの途中に含まれている場合は、人間が読めるテキストを用意してください。

source: In general, prefer using https://docs.asciidoctor.org/asciidoc/latest/macros/url-macro/[url macros] to using bare or automatic links. Provide human-readable text for the link, especially if it is included in the middle of other text.
ja_jp: 一般に、素のリンクや自動リンクよりも、 https://docs.asciidoctor.org/asciidoc/latest/macros/url-macro/[url マクロ] を使う方が望ましいです。特に、リンクが他のテキストの途中に含まれている場合は、人間が読みやすいテキストを提供してください。
